{"keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "padding": "same", "bias_constraint": null, "filters": 32, "use_bias": true, "batch_input_shape": [null, 96, 96, 1], "strides": [1, 1], "name": "conv2d_19", "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "filters": 32, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_20", "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_10"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_13", "rate": 0.1}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "filters": 64, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_21", "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "filters": 64, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_22", "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_11"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_14", "rate": 0.1}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "filters": 128, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_23", "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "filters": 128, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_24", "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_12"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_15", "rate": 0.1}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "units": 256, "name": "dense_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_16", "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "units": 30, "name": "dense_8"}}], "backend": "tensorflow", "class_name": "Sequential"}