{"keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "padding": "valid", "batch_input_shape": [null, 96, 96, 1], "filters": 32, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "filters": 64, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 128, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 30, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}], "backend": "tensorflow"}