{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 96, 96, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 128, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 128, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "units": 256, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "units": 30, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.2"}